# DivideVolumesProfilesNonSlabSources Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..DPartFailures..::..DivideVolumesProfilesNonSlabSources Property
BuiltInFailures..::..DPartFailures Class See Also
---
Some sources of a volume divider are non-slab like.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId DivideVolumesProfilesNonSlabSources { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property DivideVolumesProfilesNonSlabSources As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ DivideVolumesProfilesNonSlabSources {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..DPartFailures Class
Autodesk.Revit.DB Namespace